Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO dotfiles in a single org-file                                                          :post:
:PROPERTIES:
:TITLE: dotfiles in a single org-file
:EXPORT_FILE_NAME: dotfilesinasingleorg.html
:INDEX_DATE: <2019-01-21 Mon 19:01>
:END:

I was thinking that it would be nice to have all your configuration
files on a single, literate, org-mode file... and actually it should
be really easy to make it work: take an org file and create an org-babel block 
for the contents of each configuration file. They can be tangled
back into the filesystem using the property =:tangle /path/tofile=,
where =/path/tofile= is the desired location of the config file.
If =sudo= is needed, =tramp= can be used with =:tangle /sudo::/path/tofile=.

For instance, this is how =.Xresources= looks now inside my org file.
Highlighting works perfectly thanks to org-babel.

#+BEGIN_EXAMPLE
    ** X resources
    
    Configuration parameters for X client applications.
   
    #+BEGIN_SOURCE conf /home/mario/.Xresources
    xterm*font: *-fixed-*-*-*-24-*
    Xft.dpi:    192
    #+END_SOURCE
#+END_EXAMPLE

This file can be put under version control and a /dotfiles repository/
can be created without having to use hard links (yep, I was doing that
until now).

As always with Emacs, this use case is obvious in retrospect, but /why
didn't anyone tell me?/

