dotfilesinasingleorg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-24 Mon 10:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dotfiles in a single org-file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">dotfiles in a single org-file</h1>
<p>
I was thinking that it would be nice to have all your configuration
files on a single, literate, org-mode file&#x2026; and actually it should
be really easy to make it work: take an org file and create an org-babel block 
for the contents of each configuration file. They can be tangled
back into the filesystem using the property <code>:tangle /path/tofile</code>,
where <code>/path/tofile</code> is the desired location of the config file.
If <code>sudo</code> is needed, <code>tramp</code> can be used with <code>:tangle /sudo::/path/tofile</code>.
</p>

<p>
For instance, this is how <code>.Xresources</code> looks now inside my org file.
Highlighting works perfectly thanks to org-babel.
</p>

<pre class="example">
    ** X resources
    
    Configuration parameters for X client applications.
   
    #+BEGIN_SOURCE conf /home/mario/.Xresources
    xterm*font: *-fixed-*-*-*-24-*
    Xft.dpi:    192
    #+END_SOURCE
</pre>

<p>
This file can be put under version control and a <i>dotfiles repository</i>
can be created without having to use hard links (yep, I was doing that
until now).
</p>

<p>
As always with Emacs, this use case is obvious in retrospect, but <i>why
didn't anyone tell me?</i>
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited . Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
